{"id":"5b70b96d-aa40-435b-b7b4-65763de32d32","updated_at":"2025-10-15T12:23:06.970Z","updated_by":"elastic","created_at":"2025-10-15T11:04:25.333Z","created_by":"elastic","name":"1. T1595: Active Scanning","tags":[],"interval":"5m","enabled":true,"revision":2,"description":"This query looks for a single source IP address connecting to more than 100 different ports on your Ubuntu machine within a 10-minute time window, which could indicate a port scan.","risk_score":40,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"3c2ec065-5b75-4d87-a83c-fb0dd32a308b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.dataset : \"auditd_manager.auditd\" and event.action : \"executed\" and process.name : (\"nmap\" or \"nc\" or  \"tcpdump\" or \"masscan\" or \"tshark\")","filters":[{"meta":{"disabled":false,"negate":false,"alias":null,"index":"logs-*","key":"host.hostname","field":"host.hostname","params":{"query":"ubu"},"type":"phrase"},"query":{"match_phrase":{"host.hostname":"ubu"}},"$state":{"store":"appState"}}],"actions":[]}
{"id":"f2c43a85-00f8-42b3-a32a-0cae370612bb","updated_at":"2025-10-15T13:31:19.051Z","updated_by":"elastic","created_at":"2025-10-15T13:31:19.051Z","created_by":"elastic","name":"10. T1119: Automated Collection","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query looks for the use of the find command to search for files with common sensitive extensions.\n","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"dbebab45-5cd5-4935-b172-55fba35bbbdb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.action : \"executed\" and process.name : \"find\" and\n(\n    process.command_line : \"*.doc*\" or\n    process.command_line : \"*.xls*\" or\n    process.command_line : \"*.pdf*\" or\n    process.command_line : \"*.txt*\" or\n    process.command_line : \"*.bak*\" or\n    process.command_line : \"*.kdbx*\"\n)","filters":[],"actions":[]}
{"id":"9478b510-f61e-4ff7-b62a-6402073d1e91","updated_at":"2025-10-15T13:32:25.071Z","updated_by":"elastic","created_at":"2025-10-15T13:32:25.071Z","created_by":"elastic","name":"11. T1071: Application Layer Protocol (C2)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query looks for network connections from a process running out of a suspicious location, such as /tmp.\n","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"79b9a777-05a6-489d-8a27-0d0e62267b55","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.category : \"network\" and network.direction : \"outbound\" and\n(\n    process.executable : \"/tmp/*\" or\n    process.executable : \"/var/tmp/*\" or\n    process.executable : \"/dev/shm/*\"\n)","filters":[],"actions":[]}
{"id":"039eaa25-ce88-4b2c-9ed9-84ea67df27dd","updated_at":"2025-10-15T13:33:27.092Z","updated_by":"elastic","created_at":"2025-10-15T13:33:27.092Z","created_by":"elastic","name":"12. T1048: Exfiltration Over Alternative Protocol","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query looks for the use of scp to copy files to a remote destination.\n","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"9863918e-6ccc-4d64-8e88-432a4de862b2","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.action : \"executed\" and\n(process.name : \"scp\" or process.name : \"rsync\") and\nprocess.command_line : \"*@*\"","filters":[],"actions":[]}
{"id":"836ac860-793c-49db-9d01-8e16e8ca5069","updated_at":"2025-10-15T13:12:39.693Z","updated_by":"elastic","created_at":"2025-10-15T11:11:32.435Z","created_by":"elastic","name":"2. T1566: Phishing","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"This rule looks for a script interpreter being launched by an email client or a document application, which could indicate a user opening a malicious attachment.\n","risk_score":63,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"5f0283e6-9330-4739-933b-44eb2ae5fb46","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.action : \"executed\" and\n(\n    process.parent.name : \"thunderbird\" or\n    process.parent.name : \"outlook.exe\" or\n    process.parent.name : \"soffice.bin\" or\n    process.parent.name : \"winword.exe\" or\n    process.parent.name : \"excel.exe\" or\n    process.parent.name : \"powerpnt.exe\" or\n    process.parent.name : \"evince\" or\n    process.parent.name : \"okular\" or\n    process.parent.name : \"acrord32.exe\" or\n    process.parent.name : \"firefox\" or\n    process.parent.name : \"chrome\" or\n    process.parent.name : \"msedge.exe\"\n) and\n(\n    process.name : \"bash\" or\n    process.name : \"sh\" or\n    process.name : \"zsh\" or\n    process.name : \"cmd.exe\" or\n    process.name : \"python\" or\n    process.name : \"perl\" or\n    process.name : \"powershell.exe\" or\n    process.name : \"pwsh.exe\" or\n    process.name : \"wscript.exe\" or\n    process.name : \"cscript.exe\" or\n    process.name : \"mshta.exe\"\n)","filters":[{"meta":{"disabled":false,"negate":false,"alias":null,"index":"logs-*","key":"host.hostname","field":"host.hostname","params":{"query":"ubu"},"type":"phrase"},"query":{"match_phrase":{"host.hostname":"ubu"}},"$state":{"store":"appState"}}],"actions":[]}
{"id":"9d2a31a8-7849-44a4-90fb-867db0f6f025","updated_at":"2025-10-15T13:20:30.832Z","updated_by":"elastic","created_at":"2025-10-15T13:20:30.832Z","created_by":"elastic","name":"3. T1059: Command and Scripting Interpreter","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query looks for the use of bash with suspicious command-line arguments that are often used to execute encoded or obfuscated commands.\n","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"91b46007-6380-4448-8c42-05354bc19651","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.action : \"executed\" and\n(process.parent.name : \"thunderbird\" or process.parent.name : \"soffice.bin\" or process.parent.name : \"evince\") and\n(process.name : \"bash\" or process.name : \"sh\" or process.name : \"python\" or process.name : \"perl\")","filters":[],"actions":[]}
{"id":"4c1bbfa4-69d9-42f0-a608-818c9e8106a4","updated_at":"2025-10-15T13:21:50.857Z","updated_by":"elastic","created_at":"2025-10-15T13:21:50.857Z","created_by":"elastic","name":"4. T1547: Boot or Logon Autostart Execution","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query monitors for the creation or modification of files in common persistence locations.\n","risk_score":39,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"9abc4f77-438c-4f25-bc65-ad5f6cddc227","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.category : \"file\" and\n(event.action : \"creation\" or event.action : \"change\") and\n(\n    file.path : \"/etc/systemd/system/*\" or\n    file.path : \"/home/*/.config/autostart/*\" or\n    file.path : \"/etc/cron.d/*\" or\n    file.path : \"/etc/rc.local\"\n)","filters":[],"actions":[]}
{"id":"dfa5c68f-0fc5-43dd-93a5-b26abb251f34","updated_at":"2025-10-15T13:23:08.883Z","updated_by":"elastic","created_at":"2025-10-15T13:23:08.883Z","created_by":"elastic","name":"5. T1548: Abuse Elevation Control Mechanism","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule looks for a user trying to run sudo with the -l flag to list their permissions, which could be a precursor to privilege escalation.\n","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"0be93997-8f34-44f3-9dc2-a7fcf4201c5f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.action : \"executed\" and process.name : \"sudo\" and process.args : \"-l\"","filters":[],"actions":[]}
{"id":"d7b4459f-486d-491a-90c2-fc4d3458168f","updated_at":"2025-10-15T13:24:26.917Z","updated_by":"elastic","created_at":"2025-10-15T13:24:26.917Z","created_by":"elastic","name":"6. T1027: Obfuscated Files or Information","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query looks for the use of dd to hide data in an alternate data stream, a common obfuscation technique.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"7de48236-af08-44d3-a071-1f36e9a7c914","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.action : \"executed\" and process.name : \"dd\" and process.command_line : \"*of=*:*\"","filters":[],"actions":[]}
{"id":"ef63aac3-98f9-4602-85ed-4e98f560d572","updated_at":"2025-10-15T13:25:57.947Z","updated_by":"elastic","created_at":"2025-10-15T13:25:57.947Z","created_by":"elastic","name":"7. T1003: OS Credential Dumping","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query alerts when a process other than a standard system utility attempts to read the /etc/shadow file, which contains hashed user passwords.\n","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"fa797c0a-b092-46a0-8c81-de4a08af1ae2","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.category : \"file\" and event.action : \"access\" and\nfile.path : \"/etc/shadow\" and\nnot (\n    process.name : \"passwd\" or\n    process.name : \"chage\" or\n    process.name : \"useradd\" or\n    process.name : \"login\" or\n    process.name : \"su\" or\n    process.name : \"sudo\" or\n    process.name : \"groupadd\" or\n    process.name : \"userdel\"\n)","filters":[],"actions":[]}
{"id":"0f63d79d-e31b-49d7-8d9e-cbbe9f3c60a2","updated_at":"2025-10-15T13:27:26.975Z","updated_by":"elastic","created_at":"2025-10-15T13:27:26.975Z","created_by":"elastic","name":"8. T1082: System Information Discovery","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query looks for the execution of multiple common discovery commands by the same process, which could indicate an attacker is trying to learn about the system.\n","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"04ddb021-34f6-48f8-87f4-c87c705e61d5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.action : \"executed\" and\n(\n    process.name : \"whoami\" or\n    process.name : \"hostname\" or\n    process.name : \"uname\" or\n    process.name : \"ifconfig\" or\n    process.name : \"ip\" or\n    process.name : \"netstat\" or\n    process.name : \"lscpu\" or\n    process.name : \"lsblk\" or\n    process.name : \"ps\"\n)","filters":[],"actions":[]}
{"id":"d02f1b4d-bc9e-4568-8d50-e77d0b451e6e","updated_at":"2025-10-15T13:28:32.995Z","updated_by":"elastic","created_at":"2025-10-15T13:28:32.995Z","created_by":"elastic","name":"9. T1021: Remote Services","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This query looks for an interactive SSH session being established, which could indicate lateral movement.\n","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-9m","rule_id":"509e1b7d-5d1a-4933-83f1-bfeb7f09e966","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"event.category : \"authentication\" and event.outcome : \"success\" and\nprocess.name : \"sshd\" and\n(source.ip : \"10.0.0.0/8\" or source.ip : \"172.16.0.0/12\" or source.ip : \"192.168.0.0/16\")","filters":[],"actions":[]}
{"exported_count":12,"exported_rules_count":12,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
