{"id":"9e68f853-8a89-4e7f-8594-0383ba2805a8","updated_at":"2025-10-14T11:55:25.801Z","updated_by":"elastic","created_at":"2025-10-14T11:55:25.801Z","created_by":"elastic","name":"5. Privilege Escalation (T1548: Abuse Elevation Control Mechanism)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects a known UAC (User Account Control) bypass technique using the fodhelper.exe binary. Attackers exploit this to run commands with elevated privileges without triggering a UAC prompt.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"6727ae6d-21ee-40aa-b0a1-bbcb1c58f8cf","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"process.name : \"fodhelper.exe\" AND NOT (process.parent.name : \"explorer.exe\" OR process.parent.name : \"svchost.exe\")","filters":[],"actions":[]}
{"id":"d4fb98af-93cd-406f-b570-bbfffaa5ff59","updated_at":"2025-10-14T11:47:04.686Z","updated_by":"elastic","created_at":"2025-10-14T11:29:06.444Z","created_by":"elastic","name":"2. Initial Access (T1566: Phishing)","tags":[],"interval":"5m","enabled":true,"revision":2,"description":"This rule looks for a Microsoft Office application spawning a suspicious script interpreter, which often happens when a user opens a malicious document from a phishing email.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"51bac7dd-1389-4819-8812-50dc46744934","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"process.parent.name:(\"winword.exe\" or \"excel.exe\" or \"powerpnt.exe\" or \"outlook.exe\") and process.name:(\"powershell.exe\" or \"cmd.exe\" or \"wscript.exe\" or \"mshta.exe\")","filters":[],"actions":[]}
{"id":"4a02fcc8-e548-4dcd-b3e6-939d37fc2c0f","updated_at":"2025-10-14T12:06:55.957Z","updated_by":"elastic","created_at":"2025-10-14T12:05:01.929Z","created_by":"elastic","name":"8. Discovery (T1082: System Information Discovery)","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"This rule detects when a single process executes multiple common discovery commands in a short period of time.\n","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"623df799-a310-464a-8294-15a0c7c7e1d8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"event.category : \"process\" AND process.name : (\"whoami.exe\" OR \"systeminfo.exe\" OR \"ipconfig.exe\" OR \"net.exe\" OR \"tasklist.exe\")","filters":[],"actions":[]}
{"id":"cc9cce6a-b90d-4202-9424-c7e1dab7f331","updated_at":"2025-10-14T12:07:19.965Z","updated_by":"elastic","created_at":"2025-10-14T12:00:00.856Z","created_by":"elastic","name":"7. Credential Access (T1003: OS Credential Dumping)","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"This rule detects a process attempting to access the memory of the Local Security Authority Subsystem Service (LSASS). LSASS stores credentials, and dumping its memory is the most common way to steal them.","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"49fcd163-9359-4472-8f27-47315023d94a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"event.category:process and event.action:\"Process Create\" and process.name:lsass.exe and source.process.executable:* and not source.process.executable:(\"C:\\\\Windows\\\\System32\\\\svchost.exe\" or \"C:\\\\Windows\\\\System32\\\\services.exe\")","filters":[],"actions":[]}
{"id":"617fc00f-88bf-489d-965d-07bb554c6cc7","updated_at":"2025-10-14T12:09:00.981Z","updated_by":"elastic","created_at":"2025-10-14T12:09:00.981Z","created_by":"elastic","name":"10. Collection (T1119: Automated Collection)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"process.name:(\"7z.exe\", \"rar.exe\", \"zip.exe\") and process.command_line:(\"*.doc*\" or \"*.xls*\" or \"*.pdf*\" or \"*.txt*\") and process.command_line:(\"-p*\" or \"-hp*\")\n","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"3f756498-01bb-435e-92d1-5e19468abe64","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"process.name:(\"7z.exe\" or \"rar.exe\" or \"zip.exe\") and process.command_line:(\"*.doc*\" or \"*.xls*\" or \"*.pdf*\" or \"*.txt*\") and process.command_line:(\"-p*\" or \"-hp*\")","filters":[],"actions":[]}
{"id":"ff94c9f2-552e-494d-ad23-65a79f0c0605","updated_at":"2025-10-14T11:50:17.724Z","updated_by":"elastic","created_at":"2025-10-14T11:50:17.724Z","created_by":"elastic","name":"4. Persistence (T1547: Boot or Logon Autostart Execution)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects the creation or modification of a registry key in the common \"Run\" locations, which causes a program to execute automatically at startup.","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"5a51e164-aaae-42a4-9537-00406b2f85ba","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"event.category:registry and registry.path:(\"HKEY_CURRENT_USER\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\*\" or \"HKEY_LOCAL_MACHINE\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\*\")","filters":[],"actions":[]}
{"id":"e2d47edb-b282-4fd1-bf2e-4b65b1aa4b6b","updated_at":"2025-10-14T12:10:00.991Z","updated_by":"elastic","created_at":"2025-10-14T12:10:00.991Z","created_by":"elastic","name":"11. Command and Control (T1071: Application Layer Protocol)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects a non-browser process making network connections, which could indicate a C2 channel hiding in what looks like normal web traffic.\n","risk_score":36,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"a2b74aea-b267-4ddd-9a51-bac87083d306","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"event.category:network and destination.port:(80 or 443) and not process.name:(\"chrome.exe\" or \"firefox.exe\" or \"msedge.exe\" or \"iexplore.exe\" or \"svchost.exe\")","filters":[],"actions":[]}
{"id":"02c5bd51-30e8-43d3-bfed-cc92878ce561","updated_at":"2025-10-14T12:06:28.947Z","updated_by":"elastic","created_at":"2025-10-14T12:06:28.947Z","created_by":"elastic","name":"9. Lateral Movement (T1021: Remote Services)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects the creation of the PSEXESVC.exe service, which is the signature of the popular PsExec tool being used for lateral movement.\n","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"ec5fb1d6-1f59-428e-bfb0-0086cb81fded","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"event.category:process and process.name:PSEXESVC.exe","filters":[],"actions":[]}
{"id":"98e28761-53bb-4b46-a9fa-97527965cbf1","updated_at":"2025-10-14T11:58:47.838Z","updated_by":"elastic","created_at":"2025-10-14T11:58:47.838Z","created_by":"elastic","name":"6. Defense Evasion (T1027: Obfuscated Files or Information)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects PowerShell being launched with an encoded command. Attackers use this to hide their malicious scripts from simple keyword-based detection.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"9ddec47a-5d4c-465c-be29-ea27ce6340b8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"process.name : \"powershell.exe\" AND (process.args:\"-e\" OR process.args:\"-en\" OR process.args:\"-enc\" OR process.args:\"-encodedcommand\")","filters":[],"actions":[]}
{"id":"9a42a1f3-55fd-447a-82a6-fa0eb6e0c017","updated_at":"2025-10-14T11:46:16.670Z","updated_by":"elastic","created_at":"2025-10-14T11:46:16.670Z","created_by":"elastic","name":"1. Reconnaissance (T1595: Active Scanning)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects a single source IP connecting to a large number of different ports across your network, which is a classic sign of port scanning.","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"05e649fb-4bdf-4f4a-82ef-52b83a4c9090","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"event.category:network and event.type:connection and network.transport:tcp and not source.ip:(10.0.0.0/8 or 172.16.0.0/12 or 192.168.0.0/16)","filters":[],"threshold":{"field":["winlog.event_data.SourceIp.keyword"],"value":50,"cardinality":[{"field":"winlog.event_data.DestinationPort.keyword","value":50}]},"actions":[]}
{"id":"acb945c4-9988-4a59-a1bf-263f8b60dc3e","updated_at":"2025-10-14T12:18:06.109Z","updated_by":"elastic","created_at":"2025-10-14T12:18:06.109Z","created_by":"elastic","name":"12. Exfiltration (T1048: Exfiltration Over Alternative Protocol)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects potential DNS tunneling by finding an abnormally high number of DNS queries originating from a single host.","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"21890b79-0173-4afc-a46e-338635db2a75","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"event.category:network and event.dataset:dns","filters":[],"threshold":{"field":["winlog.event_data.SourceIp.keyword","host.hostname.keyword"],"value":200,"cardinality":[{"field":"winlog.event_data.TargetDomainName.keyword","value":100}]},"actions":[]}
{"id":"473f42f1-65be-4d5e-a39a-838c96eb5dc7","updated_at":"2025-10-14T11:48:28.698Z","updated_by":"elastic","created_at":"2025-10-14T11:48:28.698Z","created_by":"elastic","name":"3. Execution (T1059: Command and Scripting Interpreter)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects PowerShell being used to download a file from the internet, a common method for attackers to fetch their next-stage payloads.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"c99f9f9a-b0bd-49dc-b3af-3d837cfb64e1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"a6f7f1fb-e5f2-4e44-817d-47d381006ccc","query":"process.name:powershell.exe and process.command_line:(*System.Net.WebClient* or *DownloadFile* or *DownloadString* or *iwr* or *wget*)","filters":[],"actions":[]}
{"exported_count":12,"exported_rules_count":12,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
